import numpy as np

def main():
    #前半がイケメン、後半がブサメン。重複は削除済
    name_list = ["蔵","之","介","一","生","健","太","郎","賢","人","涼","真","亮","平",
                "忍","慎","二","バ","イ","ク","章","博","司"]
    x =np.array([\
        [1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],\
        [1,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],\
        [1,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],\
        [1,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0],\
        [1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0],\
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0],\
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0],\
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0],\
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0],\
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0],\
        [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],\
        [1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0]\
        ])
    #教師ラベルイケメンは1ブサメンは-1
    y_ans = np.array([1,1,1,1,1,1,-1,-1,-1,-1,-1,1])
    #教師データは線形分離可能
    w = np.array([-1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0])
    # 線形分離可能かチェック
    # for n in range(0,len(x)):
    #     res = np.dot(x[n],w)
    #     print(res*y_ans[n])
    #     if(res*y_ans[n]<=0):
    #         print("線形分離条件がダメ")
    #         return

    for k in range(0,20):#とりあえず10ループ
        print("\\multicolumn{2}{|l|}{stage"+str(k)+"}\\\\ \\hline")
        print("step&重み$\\bm{w}$[$w_0$,蔵,之,介,一,生,健,太,郎,賢,人,涼,真,亮,平,忍,慎,二,バ,イ,ク,章,博,司]\\\\ \\hline")
        for n in range(0,len(x)):
            y = f(x,w,n)
            w += (y_ans[n]-y)*x[n]
            if(n==len(x)-1):
                print(n,"&",w,"\\\\ \\hline")
            else:
                print(n,"&",w,"\\\\")

    x1 = np.array([[1,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0]])
    print("真一は")
    Result(f(x1,w,0))
    x2 = np.array([[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1]])
    print("博司は")
    Result(f(x2,w,0))
    x3 = np.array([[1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]])
    print("順之介は")
    Result(f(x3,w,0))
    case3 = ["正","章"]
    x4 = np.array([[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0]])
    print("正章は")
    Result(f(x4,w,0))
    x5 = np.array([[1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0]])
    print("健慎は")
    Result(f(x5,w,0))
    x6 = np.array([[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]])
    print("竜星は")
    Result(f(x6,w,0))

def f(x,w,n):
    y=0
    for i in range(0,len(w)):
        y += x[n][i]*w[i]
    y = np.sign(y)
    return y
def Result(y):
    if(y>0):
        print("イケメン")
    elif(y<0):
        print("イケメンじゃない")
    else:
        print("わかりません......")

#メイン呼び出し部
main()
